cmsis-svd/cmsis-svd/data/Infineon/s6e1b8xf.svd
        <!-- REGISTER "IRQ24MON" -->
        <register>
          <name>IRQ24MON</name>
          <description>IRQ24 Batch Read Register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000063F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICC1INT" -->
            <field>
              <name>ICC1INT</name>
              <description>Interrupt request of IC card (smart card interface) ch.1</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RCEC1INT" -->
            <field>
              <name>RCEC1INT</name>
              <description>Interrupt request of HDMI-CEC remport control reception ch.1</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RTCINT" -->
            <field>
              <name>RTCINT</name>
              <description>RTC interrupt request</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WCINT" -->
            <field>
              <name>WCINT</name>
              <description>Watch counter interrupt request</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UPLLINT" -->
            <field>
              <name>UPLLINT</name>
              <description>Stabilization wait completion interrupt request for USB oscillation</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MPLLINT" -->
            <field>
              <name>MPLLINT</name>
              <description>Stabilization wait completion interrupt request for main PLL oscillation</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SOSCINT" -->
            <field>
              <name>SOSCINT</name>
              <description>Stabilization wait completion interrupt request for sub-clock oscillation</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MOSCINT" -->
            <field>
              <name>MOSCINT</name>
              <description>Stabilization wait completion interrupt request for main clock oscillation</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ25MON" -->
        <register>
          <name>IRQ25MON</name>
          <description>IRQ25 Batch Read Register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCINT4" -->
            <field>
              <name>ADCINT4</name>
              <description>Range comparison result interrupt request in the A/D converter unit 0</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT3" -->
            <field>
              <name>ADCINT3</name>
              <description>Conversion result comparison interrupt request in the A/D converter unit 0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT2" -->
            <field>
              <name>ADCINT2</name>
              <description>FIFO overrun interrupt request in the A/D converter unit 0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT1" -->
            <field>
              <name>ADCINT1</name>
              <description>Scan conversion interrupt request in the A/D converter unit 0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT0" -->
            <field>
              <name>ADCINT0</name>
              <description>Priority conversion interrupt request in the A/D converter unit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ26MON" -->
        <register>
          <name>IRQ26MON</name>
          <description>IRQ26 Batch Read Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB_INT5" -->
            <field>
              <name>USB_INT5</name>
              <description>SOFIRQ/CMPIRQ interrupt request of USB ch.0</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT4" -->
            <field>
              <name>USB_INT4</name>
              <description>DIRQ/URIRQ/RWKIRQ/CNNIRQ interrupt request of USB ch.0</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT3" -->
            <field>
              <name>USB_INT3</name>
              <description>SPK interrupt request of USB ch.0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT2" -->
            <field>
              <name>USB_INT2</name>
              <description>SUSP/SOF/BRST/CONF/WKUP interrupt request of USB ch.0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT1" -->
            <field>
              <name>USB_INT1</name>
              <description>Endpoint0 DRQO interrupt request of USB ch.0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT0" -->
            <field>
              <name>USB_INT0</name>
              <description>Endpoint0 DRQI interrupt request of USB ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ27MON" -->
        <register>
          <name>IRQ27MON</name>
          <description>IRQ27 Batch Read Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000020</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDCINT" -->
            <field>
              <name>LCDCINT</name>
              <description>Interrupt request for LCD controller</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
